---
kind: type
id: T:Autodesk.Revit.DB.ScheduleHorizontalAlignment
source: html/80fa3cbc-3cfe-bcfc-ac1f-9487c45f2908.htm
---
# Autodesk.Revit.DB.ScheduleHorizontalAlignment

Horizontal alignment of data in a schedule.

## Syntax (C#)
```csharp
public enum ScheduleHorizontalAlignment
```